# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "owncloud/owncloud"
tap "shopify/shopify"
tap "mongodb/brew"
tap "github/gh"
tap "weibeld/core/k1s"
tap "elastic/tap"

# Binaries
brew "python"
brew "awscli"
brew "bash" # Latest Bash version
brew "bat" # "cat" on steroids
brew "coreutils" # Those that come with macOS are outdated
brew "ctags"
brew "dnsmasq", restart_service: true
brew "doctl"
brew "gifsicle"
brew "git-quick-stats"
brew "gnupg"
brew "go"
brew "graphicsmagick"
brew "grep"
brew "htop"
brew "httpie"
brew "hugo"
brew "imagemagick"
brew "jpegoptim"
brew "kubernetes-cli"
brew "lazygit"
brew "mackup"
brew "mas" # Mac App Store manager
brew "midnight-commander"
brew "minikube"
brew "mosh"
brew "mycli"
brew "mysql", restart_service: true, link: false
brew "nginx"
brew "nmap"
brew "node"
brew "optipng"
brew "php", restart_service: true
brew "php@7.4"
brew "composer"
brew "pkg-config"
brew "pngquant"
brew "redis", restart_service: true
brew "safe-rm"
brew "speedtest-cli"
brew "svgo"
brew "tmux"
brew "trash" # Manage the Trash bin
brew "tree" # List directories in a tree structure
brew "wget"
brew "wp-cli"
brew "youtube-dl"
brew "zlib" # Needed for Memcached
brew "zsh"
brew "zsh-completions"
brew "getantibody/tap/antibody" # ZSH Plugin Manager
brew "shopify/shopify/themekit"
brew "libunistring"
brew "git"
brew "gnupg2"
brew "sqlite"
brew "mcrypt"
brew "imagick"
brew "wifi-password"
brew "diff-so-fancy"
brew "jq"
brew "openvpn"
brew "prettyping"
brew "fzf"
brew "fd"
brew "ncdu"
brew "noti"
brew "mongodb-community"
brew "legit"
brew "pidof"
brew "gh"
brew "hub"
brew "telnet"
brew "kubectl"
brew "curl"
brew "watch"
brew "k1s"
brew "elastic/tap/elasticsearch-full"
brew "ansible"
brew "rclone"
brew "duf"
brew "cointop"
brew "wtfutil"

# Apps
cask "aerial"
cask "alfred"
cask "brave-browser"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "java"
cask "minikube"
cask "paw"
cask "postman"
cask "robo-3t"
cask "rocket"
cask "rocket-chat"
cask "skype"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "tableplus"
cask "virtualbox"
cask "quickbooks"
cask "pock"
cask "imageoptim"
cask "datagrip"
cask "tunnelblick"
cask "proxyman"
cask "ticktick"
cask "steam"
cask "ticktick"
cask "mongodb-compass"
cask "nordvpn"
cask "netnewswire"
cask "jetbrains-toolbox"
cask "sf-symbols"
cask "fliqlo"
cask "dbngin"
cask "warp"
cask "raycast"
cask "forklift"
cask "slack"
cask "tweetbot"

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'linear-linear'
# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-mono-for-powerline'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-jetbrains-mono'
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-mono'
cask 'font-cascadia-mono-pl'


mas "1Password 7", id: 1333542190
mas "Amphetamine", id: 937984704
mas "Katib", id: 925418571
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Twitter", id: 1482454543
mas "Xcode", id: 497799835
mas "Keynote", id: 409183694
